Repository: mariash/Wordpress-Plugin-Generate-Post-Thumbnails
Catalog: locale/generate-post-thumbnails-*.po
Languages: ru_ru

source: Generate Thumbnails
ru_ru: Генерация миниатюр

source: Thumbnails generation process is finished. Processed posts: %d
ru_ru: Процесс генерации миниатюр завершен. Обработано записей: %d

source: Thumbnails Generation
ru_ru: Генерация миниатюр

source: Plugin warning
ru_ru: Внимание

source: Your current theme does not support thumbnails. You need to adjust your theme in order to use this plugin. Please read plugin page for more information. Settings will appear on this page once you enable thumbnails in your theme.
ru_ru: Ваша текущая тема не поддерживает миниатюры. Чтобы использовать этот плагин необходимо включить поддержку миниатюр в теме. Пожалуйста прочитайте информацию на странице плагина. Настройки появятся сразу как миниатюры будут включены в теме.

source: No access
ru_ru: Нет доступа

source: Thumbnails generation settings
ru_ru: Настройки генерации миниатюр

source: Overwrite existing thumbnails
ru_ru: Перезаписать текущие миниатюры

source: Check this if you want existing post thumbnails to be overwritten with generated thumbnails.
ru_ru: Отметьте данный параметр, чтобы перезаписать уже существующие миниатюры.

source: Image number in the post
ru_ru: Номер изображения в записи

source: Sequence number of the image in the post to be stored as a post thumbnail. Ex. 1 for the first post image, 2 for the second, etc. If there is no image at the given number, existing thumbnail will be removed.
ru_ru: Порядковый номер изоображения в записи, которое будет сохранено как миниатюра записи. Если по данному номеру нет изображения, то существующая миниатюра будет удалена.

source: Generate thumbnails
ru_ru: Сгенерировать миниатюры

source: Javascript is disabled, you will be redirected. Please do not close your page until the process is finished.
ru_ru: Яваскрипт отключен, страница будет перенаправлена. Пожалуйста, дождитесь перезагрузки страницы для завершения обработки.

source: Please wait until the process is finished. This process may take up to several minutes, depending on the number of posts and server capacity.
ru_ru: Пожалуйста, дождитесь завершение процесса обработки. Данный процесс может занять до нескольки минут в зависимости от количества записей и возможностей сервера.

source: Wordpress uploads directory is not accessible. External images are not supported.
ru_ru: Директория загружаемых файлов недоступна. Внешние изображения не поддерживаются.
